#+TITLE: exo1
#+AUTHOR: Frederic Boileau
#+email:frederic.boileau@protonmail.com
#+html_head: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+startup:  inlineimages lognoteclock-out hideblocks
#+todo: fixme(r) todo(t) inprog(p) wait(w) | done(d)
** 6 js abstraction through bindings
lorsqu'on obtient un prêt hypothécaire à paiements fixes, on s'engage à rembourser le prêt
sur un certain nombre de mois en payant le même montant à chaque mois. si p est le
montant du prêt, et que n est le nombre de mois, et que i [sic, t] est le taux d'intérêt
annuel en pourcents, alors la formule mathématique suivante peut être utilisée
pour calculer =m=, le montant à payer à chaque mois:

$$
m = \frac{p(1+\frac{t}{12\times 100})^n \times \frac{t}{12\times 100}}
{(1+\frac{t}{12\times 100})^{n }-1}
$$

on veut en général abstraire la structure des détails d'un programme. puisque
la valeur $$ \frac{t}{12\times 100} $$ semble se repeter on déclare une nouvelles variable

#+begin_src js
// constantes
let p = 200000
let t = 5.5
let n = 360
// parametre calculé
let taux_mens = t/(12*100)
// montant a payer
let m = (p * ((1 + taux_mens)**n) * taux_mens)/(((1 + taux_mens)**n) -1)
console.log(m)
#+end_src

#+results:
: 1135.578002694001


